Revit 2020 API
LabelUtils.GetLabelFor Method (UnitType)
 Gets the user-visible name for a UnitType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2011
Syntax
C#
public static string GetLabelFor(
	UnitType unitType
)
Visual Basic
Public Shared Function GetLabelFor ( _
	unitType As UnitType _
) As String
Visual C++
public:
static String^ GetLabelFor(
	UnitType unitType
)
Parameters
unitType
Type: Autodesk.Revit.DB.UnitType
 The UnitType to get the user-visible name.
Remarks
 The name is obtained in the current Revit language.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Cannot find UnitTypeInfo for the UnitType.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace